In [1]:
"""Introduction of pandas"""
# Pandas is used for data analysis, data manipulation, visualisation and building Machine learning Model
# It is built on the numpy package and its key data structure is called the data frame.
# Important data structure in panda
# series and data frame
# series is like a 1d array
# Data frame allow you to store and maniplute tabular data in rows of observations and columns of vairable

'Introduction of pandas'

In [8]:
# Import a pands library
import pandas as pd

# read a csv(excel) file by read_csv function
df = pd.read_csv('C:\\Users\\Administrator\\Downloads\\[FreeTutorials.Eu] Udemy - Machine Learning A-Z  Become Kaggle Master\\3. Pandas\\Pandas\\weather_data.csv')

In [10]:
# Show data in file
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [17]:
# Print all vallue by group
# You can also specifies windspeed, day and temperture instead of event
# temprature is just a series vairable that help us to print all the data till loop end
df_group = df.groupby("event")
for temperature in df_group:
    print(temperature)

('Rain',         day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain)
('Snow',         day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow)
('Sunny',         day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
5  1/6/2017           31          2  Sunny)

In [14]:
# Get value by group
df_group.get_group('Rain')

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain

In [15]:
# Describe is function in pandas that return mean, minimum, maximum, standar deviation, 75th, 25th and 50th value of our data
df_group.describe()

      temperature                                               windspeed  \
            count  mean       std   min   25%   50%   75%   max     count
event
Rain          2.0  32.0  0.000000  32.0  32.0  32.0  32.0  32.0       2.0
Snow          2.0  26.0  2.828427  24.0  25.0  26.0  27.0  28.0       2.0
Sunny         2.0  33.0  2.828427  31.0  32.0  33.0  34.0  35.0       2.0


      mean       std  min   25%  50%   75%  max
event
Rain   5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

In [19]:
# Aplly sort of function in our data
# create a function that return T/F when temperature is greater than 30.

def hot_temp(x):
    return x > 30

In [23]:
# Add New column into the data and apply the hot_temp function with the help of .apply()

df['hot_temp'] = df['temperature'].apply(hot_temp)

In [24]:
df

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

In [28]:
# Add new column and create and apply function with the help of lamda funciton

df['hot_temp'] = df['temperature'].apply(lambda x: x>30)

In [29]:
df

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

In [31]:
""" Merging a data into another data """

# create random data frame
#
df2 = pd.DataFrame({
    "city":["Bilaspur","Delhi", "Chandigarh", "Mumbai"],
    "temperature" : [32, 45, 30, 40]
})
df2

         city  temperature
0    Bilaspur           32
1       Delhi           45
2  Chandigarh           30
3      Mumbai           40

In [32]:
df3 = pd.DataFrame({
    "city":["Chandigarh","Bilaspur", "Delhi", "Mumbai"],
    "humidity" : [62, 55, 39, 49]
})
df3

         city  humidity
0  Chandigarh        62
1    Bilaspur        55
2       Delhi        39
3      Mumbai        49

In [36]:
# now merge the data

# You can only merge that coulumn that are available on both data

df4 = pd.merge(df2, df3, on='city')
df4

         city  temperature  humidity
0    Bilaspur           32        55
1       Delhi           45        39
2  Chandigarh           30        62
3      Mumbai           40        49

In [38]:
pd.merge(df2,df3, on=['city'], how='inner')

         city  temperature  humidity
0    Bilaspur           32        55
1       Delhi           45        39
2  Chandigarh           30        62
3      Mumbai           40        49

In [39]:
"""Pivot table"""
df.pivot_table(values = 'temperature', index='event', aggfunc='mean')

       temperature
event
Rain            32
Snow            26
Sunny           33

In [43]:
"""Help"""
# In python if you want to about any function or module just simple type moduel or function name
# E.g = 
# to know about pandas module = help(pd)
# to know about dataframe function that in pandas library = help(pd.DataFrame)

'Help'

In [45]:
""" Pandas Series"""
# Create pandas series

a = pd.Series([1,2,3,4,5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [48]:
# check data type
type(a)

pandas.core.series.Series

In [52]:
# when you store data in pandas string it will store as object
a = pd.Series(['a', 'b', 'c'])
a

0    a
1    b
2    c
dtype: object

In [53]:
a = pd.date_range(start='01-01-2019', end = '23-05-2019')
a

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10',
               ...
               '2019-05-14', '2019-05-15', '2019-05-16', '2019-05-17',
               '2019-05-18', '2019-05-19', '2019-05-20', '2019-05-21',
               '2019-05-22', '2019-05-23'],
              dtype='datetime64[ns]', length=143, freq='D')

In [54]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

In [78]:
"""Data Frame"""
# A data frame just like a table which contain rows and columns
# Create a data frame

'Data Frame'

In [79]:
# import numpy
import numpy as np

In [80]:
# create an array with the help of numpy
# which genrate randomaly which have lowest value=20 and highest=100 and size of array = 20
temp = np.random.randint(low=20, high=100, size=[20,])
temp

array([74, 30, 25, 31, 55, 50, 87, 89, 35, 80, 23, 67, 57, 62, 63, 48, 95,
       50, 49, 50])

In [81]:
# Now with the help of choice random value generate only with value that you define in choce
name = np.random.choice(['Manish', 'Avvy', 'Aman', 'Paul'],20)
name

array(['Paul', 'Paul', 'Avvy', 'Aman', 'Avvy', 'Avvy', 'Manish', 'Paul',
       'Aman', 'Manish', 'Aman', 'Aman', 'Aman', 'Manish', 'Avvy',
       'Manish', 'Manish', 'Manish', 'Paul', 'Manish'], dtype='<U6')

In [82]:
random = np.random.choice([10,11,12,13,14],20)
random

array([10, 14, 11, 14, 14, 14, 12, 10, 11, 12, 14, 10, 13, 10, 12, 14, 13,
       10, 11, 11])

In [86]:
# create a data frame using list
a = list(zip(temp, name, random))

In [84]:
df5 = pd.DataFrame(data = a, columns=['temp', 'name', 'random'])
df5

    temp    name  random
0     74    Paul      10
1     30    Paul      14
2     25    Avvy      11
3     31    Aman      14
4     55    Avvy      14
5     50    Avvy      14
6     87  Manish      12
7     89    Paul      10
8     35    Aman      11
9     80  Manish      12
10    23    Aman      14
11    67    Aman      10
12    57    Aman      13
13    62  Manish      10
14    63    Avvy      12
15    48  Manish      14
16    95  Manish      13
17    50  Manish      10
18    49    Paul      11
19    50  Manish      11

In [85]:
type(df5)

pandas.core.frame.DataFrame

In [87]:
# using dictionary create data frame
df6 = pd.DataFrame({'temp':temp, 'name':name, 'random':random})
df6

    temp    name  random
0     74    Paul      10
1     30    Paul      14
2     25    Avvy      11
3     31    Aman      14
4     55    Avvy      14
5     50    Avvy      14
6     87  Manish      12
7     89    Paul      10
8     35    Aman      11
9     80  Manish      12
10    23    Aman      14
11    67    Aman      10
12    57    Aman      13
13    62  Manish      10
14    63    Avvy      12
15    48  Manish      14
16    95  Manish      13
17    50  Manish      10
18    49    Paul      11
19    50  Manish      11

In [88]:
type(df6)

pandas.core.frame.DataFrame

In [90]:
# show first five value of data 
# head() it return first five value of your data 
"""You can also specifie the value within it eg. head(10)"""
df6.head()

   temp  name  random
0    74  Paul      10
1    30  Paul      14
2    25  Avvy      11
3    31  Aman      14
4    55  Avvy      14

In [95]:
# show last five value of data
# tail() it return last five value of your data
df6.tail()

    temp    name  random
15    48  Manish      14
16    95  Manish      13
17    50  Manish      10
18    49    Paul      11
19    50  Manish      11

In [97]:
# checck the number of rows and coulmns
df6.shape

(20, 3)

In [98]:
# check the coulumn name
df6.columns

Index(['temp', 'name', 'random'], dtype='object')

In [100]:
# chack the value of particular columns
# df6.coulum_name or df['column_name']
df6.temp

0     74
1     30
2     25
3     31
4     55
5     50
6     87
7     89
8     35
9     80
10    23
11    67
12    57
13    62
14    63
15    48
16    95
17    50
18    49
19    50
Name: temp, dtype: int32

In [102]:
# describe is mathematical function that return mean, std, min, 25% etc
df6['temp'].describe()

count    20.000000
mean     56.000000
std      21.388634
min      23.000000
25%      44.750000
50%      52.500000
75%      68.750000
max      95.000000
Name: temp, dtype: float64

In [105]:
# info() it return the name, null value and data type and more
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
day            6 non-null object
temperature    6 non-null int64
windspeed      6 non-null int64
event          6 non-null object
hot_temp       6 non-null bool
dtypes: bool(1), int64(2), object(2)
memory usage: 278.0+ bytes

In [124]:
# change index of data
# instead of o, 1, 2 change other 
# inplace=True in this there is no permanent change so with permanent change we use inplace
# df4.set_index('temperature', inplace=true)
df4

                   city  humidity
temperature
32             Bilaspur        55
45                Delhi        39
30           Chandigarh        62
40               Mumbai        49

In [127]:
# sorting
# by index
df4.sort_index(axis=0, ascending=True)

                   city  humidity
temperature
30           Chandigarh        62
32             Bilaspur        55
40               Mumbai        49
45                Delhi        39

In [134]:
# by value
df4.sort_values(by='humidity', ascending=True)

             humidity
temperature
45                 39
40                 49
32                 55
30                 62

In [135]:
# Delet one value or column 
df4.drop(['city'], axis=1, inplace=True)
df4

             humidity
temperature
32                 55
45                 39
30                 62
40                 49

In [140]:
"""Iloc"""
# get value by index in more precise way
# df.iloc[[0,1]]
# df.iloc[0:10,1]

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [143]:
"""Reading CSV and excel"""
# df = pd.read_csv('C:\\Users\\Administrator\\Downloads\\[FreeTutorials.Eu] Udemy - Machine Learning A-Z  Become Kaggle Master\\3. Pandas\\Pandas\\weather_data.csv')
csvdata = df
csvdata
# convert csv into excel and viceversa 
# .to_excel()
# .to_csv()
# save will save into same directory
# before saving if you want to ignore index just add index=False
csvdata.to_excel('csv_data.xls', sheet_name='weather_data11')

In [145]:
# Read excel format data

exldata = pd.read_excel('csv_data.xls')
exldata

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

In [ ]:
"""Thankyou"""